//Задание:
//Создайте класс Product с полями Name (строка), Price(двойное число) и Category(строка).

//Создайте список объектов класса Product и добавьте в него несколько элементов.

//Создайте делегат FilterDelegate, который принимает объект типа Product и возвращает
//булево значение.

//Используя лямбда-выражение, создайте экземпляр делегата FilterDelegate, который будет
//фильтровать список объектов Product по какому-либо критерию (например, все продукты с ценой больше 50).

//Выведите на экран отфильтрованный список продуктов.

//Создайте делегат для вычисления общей стоимости продуктов в списке.

//Используя лямбда-выражение, создайте экземпляр делегата для вычисления общей стоимости
//продуктов в списке.

//Выведите на экран общую стоимость продуктов.

//Создайте делегат для преобразования списка продуктов в список их названий.

//Используя лямбда-выражение, создайте экземпляр делегата для преобразования списка
//продуктов в список их названий.

//Выведите на экран список названий продуктов.

class Program